//#include<stdio.h>
//int main()
//{
//	int n,num[11][11] = {0},i,j,t,min=99999;
//	scanf("%d %d", &n, &num[1][1]);
//	//输入最顶端的值
//	for (i = 2;i <= n;i++)
//	{
//		for (j = 1;j <=i;j++)
//		{
//			scanf("%d", &t);
//			//每次输入时进行判断
//			if (j == 1)
//			{
//				num[i][j] = num[i - 1][j] + t;
//				//如果位置恰好在最左边,数字只能加上自己上方的数字
//			}
//			else if (j == i)
//			{
//				num[i][j] = num[i - 1][j - 1] + t;
//				//如果位置恰好在最右边,数字只能加上自己斜上方的数字
//			}
//			else
//			{
//				num[i][j] = num[i - 1][j - 1] < num[i - 1][j] ? num[i - 1][j - 1] + t : num[i - 1][j] + t;
//				//判断自己上方和斜上方的数字大小,选出小的加上自己本身的值
//			}
//		}
//	}
//	for (i = 1; i < n; i++)
//	{
//		if (num[n][i] < min)
//			//最后一行的num的值均为所有路径中所能取到最小的,继续从其中选出最小的
//		{
//			min = num[n][i];
//		}
//	}
//	printf("%d", min);
//	return 0;
//}
//
//
//
//
//
//
//
